Revit 2027 API
ExportPDFSettings.GetActivePredefinedSettings Method
 Gets the active settings element in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExportPDFSettings GetActivePredefinedSettings(
	Document document
)
Public Shared Function GetActivePredefinedSettings (
	document As Document
) As ExportPDFSettings
public:
static ExportPDFSettings^ GetActivePredefinedSettings(
	Document^ document
)
static member GetActivePredefinedSettings :
        document : Document -> ExportPDFSettings
Parameters
document Document
 The document to find the active settings.
Return Value
ExportPDFSettings
 The active settings, or null if none.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportPDFSettings Class
Autodesk.Revit.DB Namespace